#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_ecs_task_definition.service: Refreshing state... [id=service]
aws_security_group.drift-sg: Refreshing state... [id=sg-01f4149316da129a6]
aws_security_group.web-node: Refreshing state... [id=sg-00bfe535acfb899a0]
aws_security_group.bad-sg: Refreshing state... [id=sg-039e652d4faa07ffc]
data.aws_caller_identity.current: Read complete after 0s [id=820379311794]
aws_s3_bucket.data: Refreshing state... [id=820379311794-acme-dev-data]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.financials will be created
  + resource "aws_s3_bucket" "financials" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "820379311794-acme-dev-customer-financial-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-financial"
          + "customer"    = "Customer-Name-Here"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo1"
          + "yor_trace"   = "bfbe69d5-7829-4ef0-909e-03af09afa3d5"
        }
      + tags_all                    = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-financial"
          + "customer"    = "Customer-Name-Here"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo1"
          + "yor_trace"   = "bfbe69d5-7829-4ef0-909e-03af09afa3d5"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.perthdemo will be created
  + resource "aws_s3_bucket" "perthdemo" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "820379311794-acme-dev-perth-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-perth-demo"
          + "customer"    = "Perth-IaC-Demo"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = ""
        }
      + tags_all                    = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-perth-demo"
          + "customer"    = "Perth-IaC-Demo"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = (known after apply)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.data,
  on bad-s3.tf line 7, in resource "aws_s3_bucket" "data":
   7:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @davesc63, Action: `pull_request`*